Revit 2027 API
OpenOptions Methods
The OpenOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetOpenWorksetsConfiguration |  Gets the object used to configure the worksets to open when the model is opened.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetOpenWorksetsConfiguration |  Sets the object used to configure the worksets to open when the model is opened.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
OpenOptions Class
Autodesk.Revit.DB Namespace